clear;
clc;

y0 = [20, 0.314, 0, 0.314, 0, 20, 52.38];
% 调用语句
% [T,Y] = ode45( 'func', t, y0 );
[T,Y] = runge(0, 11.3, y0, 0.05);

% 绘图
figure('Name','弹道轨迹');
plot(Y(5,:),Y(6,:), '-');  %弹道轨迹

% figure('Name','速度曲线');
% plot(T(:, 1),Y(1,:)); %速度曲线
% 
% figure('Name','弹道倾角');
% plot(T(:, 1), Y(2, :)*57.3); %弹道倾角
% 
% figure('Name','俯仰角速度');
% plot(T(:, 1), Y(3, :)*57.3); %角速度
% 
% figure('Name','俯仰角');
% plot(T(:, 1), Y(4, :)*57.3); %
% % 
% % figure('Name','质量');
% % plot(T(:, 1), Y(7, :)); %
% 
% figure('Name','攻角');
% plot(T(:, 1), (Y(4, :) - Y(2, :))*57.3); %角速度